module.exports = {
	REQ_BY: "طلب بواسطه{author}",
	INVALID_USAGE: "استخدام الأمر غير صالح!",
	INVALID_STATUS: "حالة غير صالحة. يجب أن تكون القيمة`on/off`",
	INVALID_URL: "يرجى تقديم عنوان url صالح",
	INVALID_SUB: "أمر فرعي غير صالح",
	INVALID_CONTENT: "حجج غير كافية! الرجاء تقديم محتوى صالح",
	INVALID_COLOR: "لون غير صالح. يجب أن تكون القيمة لونًا سداسي عشري صالحًا",
	INVALID_SUBCOMMAND: "أمر فرعي غير صالح",
	MAX_LINES_ERR: "يجب أن يكون رقمًا صالحًا أكبر من 0",
	NOT_NUMBER: "الرجاء إدخال إدخال رقم صحيح",
	NO_PERMISSIONS: "آسف ولكن ليس لدي إذن بإطلاق هذا الإجراء",
	NO_CHANNEL: " لم يتم العثور على قناة مطابقة {channel}",
	NO_USER: ` لم يتم العثور على مستخدم مطابق{args}`,
	ENABLED: "تم التفعيل",
	DISABLED: "تم التعطيل",
	UPDATED: "تم التحديث",
	REMOVED: "تم الازاله",
	CHANGED: "تغير",
	CHANGE: "تغير",
	RESET: "إعادة تعيين",
	NOT_FOUND: "لم يتم العثور على",
	COMMANDS: {
		ADMIN: {
			AUTO_MOD: {
				ANTI_COMMAND: {
					GHOSTPING_DONE: "GHOSTPING تم تفعيل ",
					ANITESPAM_DONE: " ANITESPAM تم تفعيل ",
					MASSMENTION_DONE: "MASSMENTION تم تفعيل "
				},
				AUTO_DELETE: {
					MESSAGE: "رسائل",
					ATTACH_DONE: "مع المرفقات سيتم الآن حذفها تلقائيًا",
					ATTACH_DONE2: "لن يتم تصفيتها للمرفقات الآن",
					INVITES_DONE: "مع دعوات الديسكورد سيتم الآن حذفها تلقائيًا",
					INVITES_DONE2: "لن يتم تصفيته لدعوات الديسكورد الآن",
					LINKS_DONE: "مع الروابط سيتم الآن حذفها تلقائيًا",
					LINKS_DONE2: "لن يتم تصفيتها للروابط الآن",
					MAX_LINES_DONE: "تم تعطيل الحد الأقصى للخط",
					MAX_LINES_DONE2: "الرسائل أطول من \`{input}\` سيتم الآن حذف الخطوط تلقائيًا"
				},
				AUTO_MOD: {
					INVALID_ACTION: "إجراء غير صالح. يمكن أن يكون العمل `Timeout`/`Kick`/`Ban`",
					NO_CONFIG: "غير مهيأ",
					DESC1: "**العدد الاقصي للخطوط**",
					DESC2: "**مانع منشن ال everone**",
					DESC3: "**مانع المرفقات**",
					DESC4: "**مانع الروابط**",
					DESC5: "**مانع روابط الدعوه**",
					DESC6: "**مانع الاسبام**",
					DESC7: "**مانع منشن ال here**",
					EMBED_AUTHOR: "تم تفعيل الرقابه التلقائيه",
					EMBED_F1: "غرفه السجلات",
					EMBED_F2: "العدد الاقصي للتحذيرات",
					EMBED_F3: "عمل",
					EMBED_F4: "تصحيح",
					STRIKE_DONE: `تم حفظ التكوين! تم تعيين الحد الأقصى من التحذيرات على {strikes}`,
					ACTION_DONE: `م حفظ التكوين! تم تعيين إجراء Automod على {action}`,
					DEBUG_DONE: `تم حفظ التكوين! التصحيح Automod الآن`,
					NO_WHITELISTED: "لا توجد قنوات مدرجة في القائمة البيضاء",
					WHITELISTED_CH: "القنوات المدرجة في القائمة البيضاء:",
					ALR_WHITELIATED: "القناة مدرجة بالفعل في القائمة البيضاء",
					WHITELISTED: `تم اضافه القناه في القائمه البيضاء`,
					NOT_WHITELISTED: "القناة غير مدرجة في القائمة البيضاء",
					REMOVED_WHITELISTED: `تمت إزالة القناة من القائمة البيضاء!`,
				},



			},
			GREETINGS: {
				FARWELL: {
					NOT_ENABLED: "لم يتم تمكين رسالة الوداع في هذا الخادم",
					NO_CONFIG: "لم يتم تكوين قناة لإرسال رسالة وداع",
					PREV_CHANNEL: "أرسل معاينة الوداع إلى",
					NO_PERMS:
						"لا أستطيع إرسال تحية إلى تلك القناة؟ أحتاج الاذن ل ارسال رسائل و رسائل الايمبد",
					SETTINGS_DONE: "تم حفظ التكوين! تم تحديث رسالة الوداع",

				},



				WELCOME: {
					NOT_ENABLED: "رسالة الترحيب غير ممكّنة في هذا الخادم",
					NO_CONFIG: "لم يتم تكوين قناة لإرسال رسالة ترحيب",
					PREV_CHANNEL: "تم إرسال معاينة الترحيب إلى",
					NO_PERMS:
						"لا أستطيع إرسال تحية إلى تلك القناة؟ أحتاج الاذن ل ارسال رسائل و رسائل الايمبد",
					SETTINGS_DONE: "تم حفظ التكوين! تم تحديث رسالة الترحيب",
				}



			},
			REACTION_ROLL: {
				ADD: {
					NO_CH: "لم يتم العثور على قنوات مطابقة",
					NO_ROLE: "لم يتم العثور على أدوار متطابقة",
					NEED_PERMS: "أنت بحاجة إلى الأذونات التالية في",
					ERR_ID: "تعذر جلب الرسالة. هل قدمت messageId صالحًا؟",
					BOT_ROLES: "لا يمكنني تعيين أدوار الروبوتات.",
					EVERY_ROLE: "لا يمكنك تعيين دور الجميع.",
					ROLE_POSTION: "أُووبس! لا أستطيع إضافة / إزالة أعضاء لهذا الدور. هل هذا الدور أعلى من دوري؟",
					EMOJI_OUTSERVER: "هذا الرمز التعبيري لا ينتمي إلى هذا الخادم",
					FAIL_REACT: "أُووبس! فشل في الرد. هل هذا رمز تعبيري صالح",
					ROLE_CONFIGED: "تم تكوين دور بالفعل لهذا الرمز التعبيري. الكتابة فوق البيانات ، \ n",
					DONE: "فعله! تم حفظ التكوين"
				},



				REMOVE: {
					ERR: "أُووبس! حدث خطأ غير متوقع. حاول مرة أخرى في وقت لاحق",
					NEED_PERMS: "أنت بحاجة إلى الأذونات التالية في",
					ERR_ID: "تعذر جلب الرسالة. هل قدمت messageId صالحًا؟",
					DONE: "فعله! تم حفظ التكوين"
				}



			},
			AUTO_ROLE: {
				NOT_MATCH: "لم يتم العثور على أدوار مطابقة مطابقة الاستعلام الخاص بك",
				NO_ID: "يرجى تقديم دور أو معرف دور",
				ERR: "أُووبس! يتم إدارة هذا الدور عن طريق التكامل",
				NO_PERMS: "ليس لدي إذن ManageRoles ",
				NO_PERMS2: "ليس لدي أذونات لتعيين هذا الدور",
			},



			COUNTER: {
				ERR: "تم تمرير الحجج غير الصحيحة! أنواع العداد: `users/members/bots`",
				ERR2: "استخدام غير صحيح! لم تقدم الاسم",
				DONE: "تم حفظ التكوين! تم إنشاء قناة العداد"
			},















			FALG_TRANS: "تم حفظ التكوين! ترجمة العلم الآن",
			MAX_WARN: {
				ERR: "يجب أن يكون الحد الأقصى للتحذيرات رقمًا صالحًا أكبر من0 ",
				ERR2: "إجراء غير صالح. يمكن أن يكون العمل `Timeout`/`Kick`/`Ban`",
				ERR3: "ليس لدي إذن لتكوين هذا الإجراء",
				DONE: "تم حفظ التكوين! تم تعيين الإجراء على"
			},
			MOD_LOG: {
				ERR: "احتاج الي اذونات لاقوم بهذا",

			},
			SET_PREFIX: {
				ERR: "لا يمكن أن يتجاوز طول البادئة 2 حرف",
				DONE: "تم تعيين البادئة الجديدة على"
			}





		},
		ANIME: {
			REACT: {
				ERR: "فشل إحضار الميم. حاول مرة أخرى!",
				ERR2: "اختيار غير صحيح: ",
				ERR3: "التفاعلات المتاحة:"
			},
		},
		ECONOMY: {
			SUB: {
				BALANCE: {
					WALLET: "المحفظه",
					BANK: "البنك",
					NET: "صافي القيمة"
				},
				DEP: {
					ERR: "الرجاء إدخال مبلغ صالح من العملات لإيداعها",
					ERR2: "انت فقط لديك",
					ERR3: "العملات  في محفظتك",
					NEW: "الرصيد الجديد",
					WALLET: "المحفظه",
					BANK: "البنك",
					NET: "صافي القيمه"
				},
				TRANSFER: {
					ERR: "الرجاء إدخال كمية صالحة من العملات لتحويلها",
					ERR2: "لا يمكنك تحويل العملات إلى الروبوتات!",
					ERR3: "لا يمكنك تحويل العملات إلى نفسك!",
					ERR4: "رصيد بنكي غير كاف! انت فقط لديك",
					ERR5: "في حسابك المصرفي.",
					ERR6: "\ n يجب إيداع عملاتك المعدنية في البنك قبل أن تتمكن من التحويل",
					UPDATED: "الرصيد المحدث",
					DONE: "لقد قمت بالتحويل بنجاح",
					TO: "الي"
				},
				WITHDRAW: {
					ERR: "الرجاء إدخال مبلغ صالح من العملات لإيداعها",
					ERR2: "انت فقط لديك",
					ERR3: "العملات المعدنية في البنك الذي تتعامل معه",
					NEW: "الرصيد الجديد",
					WALLET: "محفظة",
					BANK: "البنك",
					NET: "صافي القيمه"
				}
			},
			BANK: {
				ERR: "قدم عددًا صالحًا من العملات المعدنية التي ترغب في إيداعها",
				ERR2: "قدم عددًا صالحًا من العملات المعدنية التي ترغب في سحبها",
				ERR3: "توفير مستخدم صالح وعملات معدنية للتحويل",
				ERR4: "توفير مستخدم صالح وعملات معدنية للتحويل",
				ERR5: "قدم عددًا صالحًا من العملات التي ترغب في تحويلها"
			},
			BEG: {
				DONE: "تبرعت لك",
				DONE2: "الرصيد المحدث"
			},
			DAILY: {
				ERR: "يمكنك تشغيل هذا الأمر مرة أخرى بتنسيق",
				DONE: "مكافأتك اليومية هي",
				DONE2: "الرصيد المحدث",
			},
			GAMBLE: {
				ERR: " .يجب أن يكون مبلغ الرهان إدخال رقم صالح .الرهان حرام لي بالك",
				ERR2: "يجب أن يكون مبلغ الرهان إدخال رقم صالح ",
				ERR3: "لا يمكن أن يكون مبلغ الرهان سالبًا",
				ERR4: "لا يمكن أن يكون مبلغ الرهان أقل من 10",
				ERR5: " (بفكرك اهو ان الرهان و القمار حرام ) ليس لديك عملات كافية للمقامرة! \ n ** رصيد العملة:**",
				AMM: "مبلغ المقامرة",
				MULT: "المضاعف",
				WON: "لقد فزت",
				LOSE: "لقد خسرت",
				DONE: "رصيد المحفظة المحدث"
			},
		},
		FUN: {
			ANIMAL: {
				ERR: "تم تحديد حيوان غير صالح. الحيوانات المتوفرة"
			},
			FLIP: {
				ERR: "الرجاء إدخال نص",
				FIRST: "بدأ إرم عملة",
				SND: "العملة في الهواء",
				WINS: "فاز"
			},
			MEME: {
				ERR: "فشل إحضار الميم. حاول مرة أخرى!",
				ERR2: "لم يتم العثور على ميمي مطابقة",
			},
			SNAKE: {
				START: "**بدء لعبة الثعبان**",
				TITLE: "لعبه الثعبان ",
				OVER: "انتهت اللعبة",
			},
			TOGETHER: {
				EER: "يجب أن تكون في قناة صوتية لاستخدام هذا الأمر.",
				ERR2: "لعبة غير صالحة. \ n ألعاب صالحة"
			}
		},
		GIVEAWAYS: {
			SUB: {
				EDIT: {
					ERR: "يجب عليك تقديم معرف رسالة صالح.",
					PERMS: "You need to have the manage messages permissions to edit giveaways.",
					ERR2: "Unable to find a giveaway for messageId",
					ERR3: "An error occurred while updating the giveaway",
					DONE: "Successfully updated the giveaway!",

				},
				END: {
					ERR: "يجب عليك تقديم معرف رسالة صالح.",
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لإنهاء الهبات.",
					ERR2: "تعذر العثور على هدية لـ messageId",
					ERR3: "لقد انتهت الهبة بالفعل.",
					DONE: "تم إنهاء الهبة بنجاح",
					ERR4: "حدث خطأ أثناء إنهاء الهبة",
				},
				LIST: {
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لإدارة الهبات.",
					NO_GIVE: "لا توجد هدايا قيد التشغيل في هذا الخادم.",
					IN: "في",
					ERR: "حدث خطأ أثناء سرد الهبة",
				},
				PAUSE: {
					ERR: "يجب عليك تقديم معرف رسالة صالح.",
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لإيقاف الهبات مؤقتًا.",
					ERR2: "تعذر العثور على هدية لـ messageId",
					ERR3: "تم إيقاف هذه الهبة مؤقتًا بالفعل.",
					DONE: "النجاح! تم إيقاف الهبة مؤقتًا!",
					ERR4: "حدث خطأ أثناء إنهاء الهبة",

				},
				REROLL: {
					ERR: "يجب عليك تقديم معرف رسالة صالح.",
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لإعادة توزيع الهبات.",
					ERR2: "تعذر العثور على هدية لـ messageId",
					ERR3: "الهبة لم تنته بعد.",
					DONE: "إعادة الهبة!",
					ERR4: "حدث خطأ أثناء إنهاء الهبة",
				},
				RESUME: {
					ERR: "يجب عليك تقديم معرف رسالة صالح.",
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لاستئناف الهبات.",
					ERR2: "تعذر العثور على هدية لـ messageId",
					ERR3: "لم يتم إيقاف هذه الهبة مؤقتًا.",
					DONE: "النجاح! لم يتم إيقاف الهبة مؤقتًا!",
					ERR4: "حدث خطأ أثناء إنهاء الهبة",
				},
				START: {
					PERMS: "يجب أن يكون لديك أذونات إدارة الرسائل لبدء الهبات.",
					ERR: "يمكنك فقط بدء الهبات في القنوات النصية.",
					F1: "🎉 **** 🎉",
					F2: "🎉 **GIVEAWAY ENDED** 🎉",
					F3: "تفاعل مع 🎁  للدخول",
					F4: "كن أول من يتفاعل مع 🎁 للفوز!",
					F5: "برعاية",
					DONE: "بدأت الهبة في",
					ERR2: "حدث خطأ أثناء بدء الهبة"

				},
			},
			GIVEAWAY: {
				ERR: "استخدام غير صحيح! يرجى توفير قناة لبدء التبرع بها",
				NO_CH: "لم يتم العثور على قناة مطابقة",
				ERR2: "استخدام غير صحيح! يرجى تقديم معرف الرسالة",
				INV_DUR: "مدة غير صالحة",
				CANCELLED: "تم إلغاء إعداد الهبة. أنت لم تذكر قناة",
				NEED_PERMS: "تم إلغاء إعداد الهبة. \ n أحتاج",
				CTX: "الرجاء النقر فوق الزر أدناه لإعداد الهبة الجديدة",
				NO_RES: "لم يتم تلقي أي رد ، وإلغاء الإعداد",
				TITLE: "إعداد الهبة",
				LABEL: "ما هي المدة؟",
				PRIZE: "ما هي الجائزة؟",
				WINNERS: "عدد الفائزين؟",
				ROLE: "الدور الذي يمكن أن يشارك في الهبة",
				HOST: "هوية المستخدم التي تستضيف الهبة",
				ONGOING: "جارٍ إعداد الهبة ...",
				VALID_DUR: "تم إلغاء الإعداد. أنت لم تحدد مدة صالحة",
				VALID_WIN: "تم إلغاء الإعداد. لم تقم بتحديد عدد صحيح فائز",
				VALID_HOST: "تم إلغاء الإعداد. تحتاج إلى توفير معرف مستخدم صالح للمضيف",
				GIVE_EDIT: "تحرير الهبة",
				EDIT_CTX: "الرجاء الضغط على الزر أدناه لتعديل الهبة",
				EDIT_NO_RES: "لم يتم تلقي رد ، وإلغاء التحديث",
				EDIT_TITLE: "تحديث الهبة",
				EDIT_C_CTX: "لم يتم تلقي رد ، وإلغاء التحديث",
				EDIT_ONGOING: "تحرير جاري الانتظار .....",
				EDIT_VALID_DUR: "تم إلغاء التحديث. لم تحدد مدة إضافة صالحة",
				EDIT_VALID_WINS: "تم إلغاء التحديث. لم تقم بتحديد عدد صحيح فائز",
			}

		},
		IMAGE: {
			FILTERS: {
				ERR: ""
			},
		},
		INFORMATION: {
			MESSAGE: {
				BOTINVITE: {
					DM: "تحقق من رسالتك المباشرة لمعلوماتي! :envelope_with_arrow:",
					ERR: "لا استطيع ارسال المعلومات . بالرجاء فتح الخاص",
				},
				CHANNELINFO: {
					NO_SEARCH: "لم يتم العثور على قنوات مطابقة",
					MULTI: "تم العثور على قنوات متعددة مطابقة",
				},
				UPTIME: {
					RES: "وقت التشغيل الخاص بي"
				},
			},
			SHARED: {
				AVATAR: {
					TITLE: "الصورة الرمزية لـ",
					LINKS: "الروابط",
				},
				BOTINVITE: {
					DESC: "مرحبًا يا من هناك! شكرًا لك على التفكير في دعوتي \ n استخدم الزر أدناه للتنقل إلى المكان الذي تريده",
					INVITE: "دعوة الارتباط",
					SUPPORT: "خادم الدعم",
					WEB: "ارتباط لوحة القيادة",
				},
				BOTSTATS: {
					GUILDS: "السيرفرات",
					CHANNELS: "اجمالي القنوات",
					USERS: "اجمالي المستخدمين",
					WEBSOC: "البينغ",
					TITLE: "معلومات البوت",
					F1: "المعالج",
					F2: "ذاكره التخزين العشوائيه",
					F3: "ذاكرة الوصول العشوائي الشاملة",
					F4: "اصدار نود جي اس",
					F5: "مدة التشغيل",
					LINK: "رابط الدعوه",
					SUPPORT: "سيرفر الدعم",
					WEB: "رابط لوحه التحكم",
				},
				CHANNELINFO: {
					ID: "id",
					NAME: 'الاسم',
					TYPE: 'النوع',
					CAT: 'فئة',
					TOPIC: 'عنوان',
					POSITION: 'موقع',
					SLOWMODE: 'وضع بطيء',
					ISNSFW: 'محتوي مقدم للبالغين',
					OWNERID: 'اي دي المالك',
					ARCHIVED: 'مؤرشف',
					LOCKED: 'مقفل',
					BITRATE: 'معدل البت',
					USERLIMIT: 'حد المستخدم',
					FULL: 'ممتلئ',
					AUTHOR: 'تفاصيل القناة'
				},
				EMOJIINFO: {
					TITLE: 'معلومات الرموز التعبيرية',
					ID: 'الاي دي',
					NAME: 'الاسم',
					ANIM: 'مفعم بالحيوية',
					ERR: "هذا ليس رمزًا تعبيريًا صالحًا للسيرفر"
				},
				GUILDINFO: {
					ID: 'الاي دي',
					NAME: 'الاسم',
					OWNER: 'المالك',
					REGION: 'منطقة',
					TITLE: 'معلومات السيرفر',
					ALL: 'أعضاء الخادم',
					MEMB: 'الاعضاء',
					BOTS: 'البوتات',
					ONLINE: 'الاشخاص الفعالين',
					CATS: "الفئات والقنوات",
					CAT: "فئات",
					TEXT: 'نص',
					VOICE: 'الصوتي',
					THREAD: 'الثريد',
					ROLES: 'الأدوار',
					F1: "تَحَقّق",
					F2: "عدد البوستات",
					F3: "تم إنشاء الخادم"
				},
				USERINFO: {
					AUTHOR: "معلومات المستخدم لـ",
					F1: "اسم المستخدم",
					F2: 'الاي دي',
					F3: "دخول السيرفر",
					F4: "تسجيله في الديسكورد",
					F5: "الادوار",
					F6: "رابط الصوره الشخصيه",
				},
			},
			SLASH: {
				BOT: {
					DM: "تحقق من الرسائل المرسله اليك :envelope_with_arrow:",
					ERR: "همم قم بفتح خاصك حتي اسطيع ان ارسل الرساله اليك",
					UP: 'وقت الشغيل',
					DESC: "مرحبًا يا من هناك! شكرًا لك على التفكير في دعوتي \ n استخدم الزر أدناه للتنقل إلى المكان الذي تريده",
					LINK: "رابط الدعوه",
					SUPPORT: "سيرفر الدعم",
					WEB: "رابط لوحه التحكم",
				},
			},
			PING_COMMAND: {
				REPLY: `🏓 بونج: \`{ping}ملي ثانيه\``
			},
			LEADERBOARD: {
				RES_ERR: "نوع لوحة الصدارة غير صالح. اختيار إما`xp` or `invite`",
				DISABELD: "هذه الميزه معطله في هذا الخادم",
				NO_USERS: "لا يوجد مستخدمين في لوحه الصداره",
				XP_AUTHOR: "لوحه الصداره ",
				INV_AUTHOR: "دعوه للوحه الصداره",
			},
		},
		INVITES: {
			ADD: {
				NOMENTION: "بناء جملة غير صحيح. يجب أن تذكر الهدف",
				NUMBER: "يجب أن يكون مبلغ الدعوة رقمًا",
				ERR: "أُووبس! لا يمكنك إضافة دعوات إلى برامج الروبوت",
				AUTHOR: "تمت إضافة الدعوات إلى",
				DESC: "لديها الآن",
				DESC2: "يدعو",
			},
			CODES: {
				ERR: "ليس لديه دعوات في هذا الخادم",
				USES: "الاستخدامات",
				AUTHOR: "رمز الدعوة لـ",

			},
			INVITER: {
				ERR: 'تم تعطيل تتبع الدعوة في هذا الخادم',
				ERR2: "لا يمكن تتبع كيف",
				ERR3: "انضم",
				AUTHOR: "دعوة البيانات لـ",
				F1: "الداعي",
				F2: "معرف الداعي",
				F3: " رقم الدعوة",
				F4: "يدعو يدعو",
			},
			RANK: {
				ERR: "ليس عدد الدعوات صالحًا؟",
				ERR2: "لم يتم العثور على أدوار متطابقة",
				ERR3: 'تم تعطيل تتبع الدعوة في هذا الخادم',
				ERR4: "لا يمكنك تعيين دور الروبوت",
				ERR5: "لا يمكنني تعيين دور كل فرد.",
				ERR6: "إنني أفتقد أذونات لنقل الأعضاء إلى هذا الدور. هل هذا الدور أقل من أعلى دوري؟",
				ERR7: "تم العثور على التكوين السابق لهذا الدور. الكتابة فوق البيانات \ n",
				ERR8: "لم يتم تكوين رتبة دعوة سابقة لهذا الدور",
				SUCCESS: "النجاح! تم حفظ التكوين.",
			},
			RANKS: {
				ERR: "لم يتم تكوين صفوف دعوة في هذا الخادم",
				INV: "يدعو",
				AUTHOR: "دعوة الرتب",
			},
			INVITES: {
				ERR: 'تم تعطيل تتبع الدعوة في هذا الخادم',
				AUTHOR: "يدعو إلى",
				INV: "يدعو",
				F1: "إجمالي الدعوات",
				F2: "دعوات وهمية",
				F3: "تم دعوتهم ولاكن غادرو",
			},
			IMPORT: {
				ERR: "أُووبس! لا يمكنك استيراد دعوات للروبوتات",
				DONE: "فعله! تمت إضافة الدعوات السابقة إلى"
			},
			TRACKER: {
				ERR: "`Manage Server`, `Manage Channels` همم هناك افتقد لبعض الاذونات احتاج الي ",
				ERR2: "قد لا أتمكن من تتبع الدعوات بشكل صحيح \ n أنا مفقود إذن \ `إدارة القناة \` في القنوات التالية ",
				DONE: "تم حفظ التكوين! دعوة تتبع الآن "
			},
			REST: {
				ERR: "بناء جملة غير صحيح. يجب أن تذكر الهدف",
				DONE: "فعله! الدعوات التي تم مسحها لـ",
			},
		},
		MODERATION: {
			MESSAGE: {
				DEFINE: {
					ERR: "لم يتم العثور على مستخدم مطابق",
				},
				MOVE: {
					ERR: "لم يتم العثور على مستخدم مطابق",
					ERR2: "لم يتم العثور على قنوات متطابقة",
					ERR3: "القناة المستهدفة ليست قناة صوتية",
				},
				PURGE: {
					ERR: "الأرقام مسموح بها فقط",
					ERR2: "الحد الأقصى لعدد الرسائل التي يمكنني حذفها هو 99",
					DONE: "تم الحذف بنجاح",
					ERR3: "ليس لدي قراءة سجل الرسائل وإدارة الرسائل لحذف الرسائل",
					ERR4: "ليس لديك قدره قراءة سجل الرسائل وإدارة الرسائل لحذف الرسائل",
					ERR5: "لم يتم العثور على رسائل يمكن تنظيفها",
					ERR6: 'حدث خطأ! فشل حذف الرسائل',
					ERR7: "لم يتم العثور على مستخدمين مطابقين",
				},
				UNDEFINE: {
					ERR: "لم يتم العثور على مستخدمين مطابقين",
				},
			},
			SHARED: {
				DEFINE: {
					ERR: "يصم الآذان في هذا الخادم",
					PERMS: "ليس لديك إذن للصم",
					PERMS2: "ليس لدي إذن للصم",
					ERR2: "أصم بالفعل",
					ERR3: "فشل في أن يصم الآذان",
					ERR4: "ليس في أي قناة صوتية",
				},
				DISCONNECT: {
					ERR: "ليس في قناة صوتية",
					PERMS: "ليس لديك إذن لقطع الاتصال",
					PERMS2: "ليس لدي إذن لقطع الاتصال",
					ERR2: "ليس في أي قناة صوتية",
					ERR3: "فشل قطع الاتصال",
				},
				MOVE: {
					ERR: "يصم الآذان في هذا الخادم",
					PERMS: "ليس لديك إذن للتحرك",
					PERMS2: "ليس لدي إذن للتحرك",
					ERR2: "ليس في أي قناة صوتية",
					ERR3: "فشل في التحرك",
					ERR4: "ليس لديه إذن للانضمام",
					ERR5: "متصل بالفعل بـ",
				},
				UNDEFINE: {
					ERR: "يصم الآذان في هذا الخادم",
					PERMS: "ليس لديك إذن للصم",
					PERMS2: "ليس لدي إذن للصم",
					ERR2: "ليس في أي قناة صوتية",
					ERR3: "فشل في أن يصم الآذان",
					ERR4: "لا يصمم",
				},
				VMUTE: {
					ERR: "هو كتم الصوت في هذا الخادم",
					PERMS: "ليس لديك إذن للتجاهل",
					PERMS2: "ليس لدي إذن لكتم الصوت",
					ERR2: "ليس في أي قناة صوتية",
					ERR3: "فشل كتم الصوت",
					ERR4: "تم كتم صوته بالفعل",
				},
				VUNMUTE: {

					ERR: "هو الصوت غير مكتوم في هذا الخادم",
					PERMS: "ليس لديك إذن لإلغاء كتم الصوت",
					PERMS2: "ليس لدي إذن لإلغاء كتم الصوت",
					ERR2: "ليس في أي قناة صوتية",
					ERR3: "فشل إعادة الصوت",
					ERR4: "ليس صامتًا",
				},
			},
			SLASH: {
				PURGE: {
					ERR: "أُووبس! اختيار أمر غير صالح",
					DONE: "تم تنظيفها بنجاح",
					DONE2: "رسائل في",//طيييبه قلبك
					PERMS: "ليس لديك أذونات لقراءة محفوظات الرسائل وإدارة الرسائل بتنسيق",
					PERMS2: "ليس لدي أذونات لقراءة محفوظات الرسائل وإدارة الرسائل بتنسيق",
					NO_MESSAGES: "لم يتم العثور على رسائل يمكن تنظيفها",
					FAIL: "فشل تنظيف الرسائل",
				},
			},
			BAN: {
				ERR: "محظور!",
				PERMS: "ليس لدي إذن بالحظر",
				PERMS2: "ليس لديك إذن بالحظر",
				FAIL: "فشل الحظر",
			},
			KICK: {
				ERR: "تم طرد",
				PERMS: "ليس لدي الاذونات للطرد",
				PERMS2: "ليس لديك الاذونات للطرد 🙂",
				FAIL: "فشل الطرد",
			},
			NICK: {
				ERR: "الرجاء تحديد لقب",
				ERR2: "أُووبس! لا يمكنك إدارة لقب",
				ERR3: "أُووبس! لا أستطيع إدارة لقب",
				SUCCESS: "بنجاح",
				SUCCESS2: "لقب",
				FAIL: "رسبت في",
				FAIL2: "لقب",
				FAIL3: "هل قدمت اسمًا صالحًا؟",
			},
			SOFT_BAN: {
				ERR: "حظر مخفف",
				PERMS: "لبس لدي الذونات للحظر المخفف",
				PERMS2: "ليس لديك اذن للحظر المخفف",
				FAIL: "فشل في الحظر المخفف",
			},
			TIMEOUT: {
				ERR: "يرجى تقديم مدة صالحة. مثال: 1d/1h/1m/1s",
				ERR: "انتهت مهلة!",
				PERMS: "ليس لدي إذن بالمهلة",
				PERMS2: "ليس لديك إذن بالمهلة",
				FAIL: "انتهت مهلة بالفعل!",
				FAIL2: "فشل انتهاء المهلة",
			},
			UNBAN: {
				NO_USER: "لم يتم العثور على مستخدم مطابق",
				PLACEHOLDER: "اختر مستخدمًا لإلغاء الحظر",
				CTX: "الرجاء تحديد المستخدم الذي ترغب في إلغاء حظره",
				ERR: "غير محظور!",
				FAIL: "فشل في فك الحظر",
				FINISHED: "أُووبس! نفد وقته. حاول مرة أخرى في وقت لاحق.",
			},
			UNTIMEOUT: {
				GO: "مهلة",
				GO2: "تم حذفه!",
				PERMS: "ليس لدي إذن لإزالة مهلة",
				PERMS2: "ليس لديك إذن لإزالة مهلة",
				ERR: "لم تنته مهلة!",
				FAIL: "فشل إزالة مهلة"
			},
			WARN: {
				PERMS: "ليس لدي إذن بالتحذير",
				PERMS2: "ليس لديك إذن للتحذير",
				ERR: "محذر!",
				FAIL: "فشل في التحذير"
			},
			WARNINGS: {
				NO_USER: "لم يتم تقديم أي مستخدم",
				BOTS_X: "ليس لدى الروبوتات تحذيرات",
				HAS: "ليس لديه تحذيرات",
				WARNINGS: "تحذيرات",
				SUCCESS: "تم مسح التحذيرات",
			},
		},
		SOCIAL: {
			REP: {
				NO_USER: "الرجاء تقديم مستخدم صالح لإعطاء سمعة له",
				No_REP: "ليس له سمعة بعد",
				AUTHOR: "سمعة ل",
				F1: "معطى",
				F2: "تلقى",
				BOTS_X: "لا يمكنك إعطاء سمعة للروبوتات",
				YOU_X: "لا يمكنك إعطاء سمعة لنفسك",//كيف انت عاوز تبوظ شرع ربنا
				TIMEOUT: "يمكنك تشغيل هذا الأمر مرة أخرى بتنسيق",
			},
		},

		STATS: {
			RANK: {
				DISABLED: "تم تعطيل تعقب الإحصائيات على هذا الخادم",
				NOT_RANKED: "لم يتم ترتيبها بعد",
				FAIL: "فشل إنشاء بطاقة رتبة",
			},
			STATS: {
				DISABLED: "تم تعطيل تعقب الإحصائيات على هذا الخادم",
				F1: "اسم المستخدم",
				F2: "الاي دي",
				F3: "⌚ عضو منذ",
				F4: "💬 تم إرسال الرسائل",
				F5: "🎙️ احصائيات الصوت",
				FOOTER: "تم إنشاء الإحصائيات",
				DESC: "الرسائل المرسلة",
				DESC1: "أوامر البادئة",
				DESC2: "اوامر ال /",
				DESC3: "XP المكتسبة",
				DESC4: "المستوى الحالي",
				DESC5: "إجمالي الاتصالات",
				DESC6: "قضاء الوقت",
			},
			STATS_TRACKING: {
				DONE: "تم حفظ التكوين! تتبع الإحصائيات الآن",
			},
			XP: {
				ERR: "قناة غير صالحة. يرجى تقديم قناة صالحة",
				ERR1: "رسالة غير صحيحة. يرجى تقديم رسالة",
				MESSAGE_DONE: "تم حفظ التكوين. تم تحديث رسالة رفع المستوى!",
				CH_DONE: "تم حفظ التكوين. تم تحديث قناة المستوى الأعلى!",
			},
		},
		SUGGESTIONS: {
			SUGGEST: {
				DONE: "تم تقديم اقتراحك!",
				DISABLED: "تم تعطيل نظام الاقتراح.",
				CH_NOT_CONFIG: "قناة الاقتراح غير مهيأة!",
				CH_NOT_FOUND: "قناه الاقتراحات غير موجوده",
				TITLE: "اقتراح جديد",
				DESC: "المرسل",
				FAIL: "فشل إرسال رسالة لقناة الاقتراحات!",
				BTN: "يوافق",
				BTN1: "يرفض",
				BTN2: "يمسح",
			},
			SUGGESTION: {
				ERR: "لم يتم العثور على قنوات مطابقة لـ",
				ERR1: "تم العثور على قنوات متعددة لـ",
				ERR2: "يرجى أن يكون أكثر تحديدا.",
				STATS_DONE: "نظام الاقتراح الآن",
				DISABLED: "تم تعطيل الاقتراحات لهذا الخادم",
				PERMS: "أحتاج إلى الأذونات التالية في",
				WL_SENT: "سيتم الآن إرسال الاقتراحات إلى",
				CH_APPROVED: "تم تعطيل القناة المعتمدة على الاقتراح الآن",
				WL_APP_SENT: "سيتم الآن إرسال الاقتراحات المعتمدة إلى ",
				CH_REJECT: "اقتراح القناة المرفوضة معطلة الآن",
				WL_REJ_SENT: "سيتم الآن إرسال الاقتراحات المرفوضة إلى",
				ROLE: " هو بالفعل دور الموظفين",
				ROLE1: "هو الآن دور الموظفين",
				ROLE2: "ليس دور الموظفين",
				ROLE3: "لم يعد دور الموظفين",
			},
		},
		TICKET: {
			TICKET: {
				PERMS: "افتقد إدارة القنوات لإنشاء قنوات التذاكر",
				NO_CH: "لم أتمكن من العثور على قناة بهذا الاسم",
				ERR: "يرجى توفير قناة حيث يجب إرسال سجلات التذاكر",
				CLOSING: "إغلاق التذاكر ...",
				ERR1: "يرجى تقديم مستخدم أو دور لإضافته إلى التذكرة",
				ERR2: "يرجى تقديم مستخدم أو دور لإزالته",
				BTN: "رسالة الإعداد",
				CTX: "الرجاء النقر فوق الزر أدناه لإعداد رسالة تذكرة",
				CTX1: "لم يتم تلقي أي رد ، وإلغاء الإعداد",
				TITLE: "إعداد التذاكر",
				BTN1: "عنوان الايمبد",
				BTN2: "ديسكريبشن الايمبد",
				BTN3: "فوتر الايمبد",
				BTN4: "أدوار الموظفين",
				BTN5: "افتح تذكرة",
				CANCEL: "لم يتم تلقي أي رد ، وإلغاء الإعداد",
				ONGOING: "جارٍ إعداد رسالة تذكرة ...",
				AUTHOR: "بطاقة الدعم",
				DESC: "الرجاء استخدام الزر أدناه لإنشاء تذكرة",
				FOOTER: "يمكنك فتح تذكرة واحدة فقط في كل مرة!",
				SUCCESS: "فعله! تم إنشاء رسالة تذكرة",
				LOG_PERMS: "أُووبس! لدي إذن لإرسال التضمين إلى",
				LOG_DONE: "تم حفظ التكوين! سيتم إرسال سجلات التذاكر إلى",
				LIMIT: "تم حفظ التكوين. يمكنك الآن الحصول على حد أقصى",
				LIMIT1: " تذاكر مفتوحة",
				CLOSE_ERR: "لا يمكن استخدام هذا الأمر إلا في قنوات التذاكر",
				CLOSE_REASON: "تم إغلاقه من قبل الوسيط",
				CLOSE_PERMS: "ليس لدي إذن لإغلاق التذاكر",
				CLOSE_ERR1: "حدث خطأ أثناء إغلاق التذكرة",
				CLOSE_ALL: "مكتمل! النجاح",
				CLOSE_ALL1: "باءت بالفشل",
				ADD_ERR: "أُووبس! تحتاج إلى إدخال معرف مستخدم / معرف صالح",
				ADD_DONE: "فعله",
				ADD_FAIL: "فشل في إضافة المستخدم / الدور. هل قدمت هوية صالحة؟",
				REMOVE_FAIL: "فشل إزالة المستخدم / الدور. هل قدمت هوية صالحة؟",
			},
			TICKET_CAT: {
				NO_CAT: "لم يتم العثور على فئات تذاكر.",
				F1: "العاملين",
				F2: "لا أحد",
				AUTHOUR: "فئات التذاكر",
				ERR: "استخدام غير صالح! اسم الفئة مفقود.",
				CAT: "فئة",
				ALREADY: "موجود أصلا.",
				ADDED: "مضاف.",
				NOT_EX: "غير موجود.",
				REMOVED: "إزالة",
			},
		},
		UTILS: {
			BIGEMOJIE: {
				AUTHOR: "❯ تعبيري كبير ❮",
				ERR: "ليس رمز تعبيري صالح",
			},
			COVID: {
				ERR: " لم يتم العثور على البلد بالاسم المقدم",
				TITLE: "مرض فيروس كورونا",
				F1: "مجموع الحالات",
				F2: "حالات اليوم",
				F3: "إجمالي الوفيات",
				F4: "الوفيات اليوم",
				F5: "تعافى",
				F6: "نشيط",
				F7: "حرج",
				F8: "حالات لكل 1 مليون",
				F9: "وفيات لكل مليون",
				FOOTER: "آخر تحديث في",
			},
			GITHUB: {
				NO_USER: "```لم يتم العثور على مستخدم بهذا الاسم```",
				CLICK: "انقر فوق لي",
				NOT_PROV: "غير مزود",
				AUTHOR: "مستخدم جيت خب",
				F1: "معلومات المستخدم",
				F2: "الإحصائيات الاجتماعية",
				F1_NAME: "الاسم الحقيقي",
				F1_LOCATION: "موقع",
				F1_GIT_ID: "الاي دي ل جيت هب",
				F1_WEBSITE: "موقع الكتروني",
				F2_FOLLOWERS: "متابعون",
				F2_FOLLWING: "التالية",
				F2_BIO: "السيرة الذاتية",
			},
			HELP: {
				NO_MATCH: "لم يتم العثور على أمر مطابق",
				DESC: "عرض الأوامر بتنسيق",
				CAT: "الفئة",
				PLACEHOLDER: "اختر فئة الأمر",
				EDESC: "**نبذة عني: ** \ n",
				EDESC1: "مرحبا أنا",
				EDESC2: "روبوت شقاق رائع متعدد الأغراض يمكنه تلبية جميع احتياجاتك \ n \ n",
				EDESC3: "إدعوني",
				SUPP: "خادم الدعم",
				FILTER: "**عوامل التصفية المتوفرة: ** \ n",
				GENRATOR: "المولدات المتوفرة",
				CMD: "أوامر",
				NO_CMD: "لا توجد أوامر في هذه الفئة",
				FDESC: "وصف",
				FSUB: "الأوامر الفرعية",
				BDESC: "\ n \ n يمكنك استخدام أوامر الصور هذه بالتنسيقات التالية \ n",
				BDESC1: "يختار الصورة الرمزية لمؤلفي الرسائل كصورة \ n",
				BDESC2: "تم الإشارة إلى الصورة الرمزية للأعضاء كصورة \ n",
				BDESC3: "ينتقي الصورة من URL المتوفر \ n",
				BDESC4: "يختار الصورة المرفقة",
			},
			SETLANG: {
				ERR: "لا يمكن أن يتجاوز طول اللغة حرفين",
				DONE: "تم تعيين لغة المستخدم الجديدة على",
				NOT_SUP: "آسف لكنني لم أدعم هذه اللغة \ n اللغات المدعومة هي",
			},
			TRANSLATE: {
				ERR: "كود الترجمة غير صالح. يزور",
				ERR2: " لمشاهدة قائمة رموز الترجمة المدعومة",
				ERR3: "قدم بعض نصوص الترجمة الصالحة",
				FAIL: "فشل ترجمة النص الخاص بك",
			},
			URBAN: {
				NOTHING: "لم يتم العثور على نتائج مطابقة",
				DESC: "تعريف",
				F1: "مؤلف",
				F2: "الاي دي",
				F3: "يحب / يكره",
				F4: "مثال",
				F5: "مخلوق",
			},
		},
	},
	CONTEXT: {
		AVATAR: {
			TITLE: "الصورة الرمزية لـ",
			HEAD: "الروابط"
		},
	},
	EVENTS: {
		MESSAGE_EVENT: {
			MENTION_REPLY: "> البادئة الخاصة بي هي \`{prefix}\`",
			MAINTACE_MESSAGE: "معذرة ولكنني مازلت الآن \ n يمكن للمسؤولين فقط استخدام أوامر / التفاعل",
			DM_REPLY: "آسف ولكن لا يمكنني إطلاق الأوامر / التفاعلات في قنوات DM ، يمكنك إطلاقها في السيرفرات فقط",
		},
	},
}